Repository: kenchase/cts-awards
Catalog: languages/cts-awards-*.po
Languages: es_es

source: CTS Awards
es_es: Premios CTS

source: This plugin requires Advanced Custom Fields to be installed and activated.
es_es: Este plugin requiere que Advanced Custom Fields esté instalado y activado.

source: Awards
es_es: Premios

source: Award
es_es: Premio

source: Add Award
es_es: Añadir Premio

source: Add New Award
es_es: Añadir Nuevo Premio

source: Edit Award
es_es: Editar Premio

source: New Award
es_es: Nuevo Premio

source: View Award
es_es: Ver Premio

source: View Awards
es_es: Ver Premios

source: Search Awards
es_es: Buscar Premios

source: No Award found
es_es: No se encontró Premio

source: No Award found in Trash
es_es: No se encontró Premio en la Papelera

source: All Awards
es_es: Todos los Premios

source: Award Archives
es_es: Archivos de Premios

source: Award Attributes
es_es: Atributos del Premio

source: Award Categories
es_es: Categorías de Premios

source: Award Category
es_es: Categoría de Premio

source: Search Award Categories
es_es: Buscar Categorías de Premios

source: All Award Categories
es_es: Todas las Categorías de Premios

source: Parent Award Category
es_es: Categoría de Premio Padre

source: Parent Award Category:
es_es: Categoría de Premio Padre:

source: Edit Award Category
es_es: Editar Categoría de Premio

source: Update Award Category
es_es: Actualizar Categoría de Premio

source: Add New Award Category
es_es: Añadir Nueva Categoría de Premio

source: New Award Category Name
es_es: Nuevo Nombre de Categoría de Premio

source: Loading awards...
es_es: Cargando premios...

source: Loading more awards...
es_es: Cargando más premios...

source: No awards found matching your criteria.
es_es: No se encontraron premios que coincidan con sus criterios.

source: Error loading awards. Please try again.
es_es: Error al cargar premios. Por favor, inténtelo de nuevo.

source: Scroll down to load more awards...
es_es: Desplácese hacia abajo para cargar más premios...

source: Show Filters
es_es: Mostrar Filtros

source: Hide Filters
es_es: Ocultar Filtros

source: CTS Awards: ACF plugin is required but not available
es_es: Premios CTS: El plugin ACF es requerido pero no está disponible

source: Search Awards:
es_es: Buscar Premios:

source: Search by name, organization, title, or keywords...
es_es: Buscar por nombre, organización, título o palabras clave...

source: Filter by Award:
es_es: Filtrar por Premio:

source: Filter by Year:
es_es: Filtrar por Año:

source: All Years
es_es: Todos los Años

source: Filter by Category:
es_es: Filtrar por Categoría:

source: All Categories
es_es: Todas las Categorías

source: Reset Filters
es_es: Restablecer Filtros
